exercises/E03_Bike/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.24;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.24;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.24;
        value           uniform 0.24;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.24;
    }
    "motorBike_.*"
    {
        type            kqRWallFunction;
        value           uniform 0.24;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    "(front|back)"
    {
        type            symmetryPlane;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
